utat-ss/FINCH-Firmware/Src/drivers/STM32_uart/uart.h
/*
 * uart.h
 *
 *  Created on: Oct 10, 2020
 *      Author: Ketan
 */

#ifndef DRIVERS_STM32_UART_UART_H_
#define DRIVERS_STM32_UART_UART_H_

#ifdef STM32G474xx
#include <stm32g4xx_hal.h>
#endif

#ifdef STM32H743xx
#include <stm32h7xx_hal.h>
#include <stm32h7_startup.h>
#endif

#include <drivers/STM32_gpio/gpio.h>

/*
There is lots of confusion around UART vs USART, more generically referred to as
UxART. UART is an asynchronous mode of communication, while USART is a
synchronous mode. Some hardware pins/interfaces on the MCU are labelled as
USART, meaning they can function as either a UART (asynchronous mode) or a USART
(synchronous mode). Some pins/interfaces are labelled as UART, meaning they can
only function as a UART (asynchronous mode).

Looking at the STM32H7 HAL/LL drivers manual (UM2217) for example, we see that
the HAL has completely separate libraries and functions for UART vs. USART.
Therefore, this library only implements UART mode (asynchronous). If we want to
use USART mode (synchronous) in the future, we can implement a separate library
for it.

UART supports a "FIFO mode" which is disabled by default. If this mode is
enabled (RM0433 p.2046), the MCU buffers multiple bytes for UART TX and RX.
Each FIFO's size is 16 words (RM0433 p.2041).

We choose to use FIFO mode for a potential performance improvement by buffering multiple bytes when appropriate.
We are using DMA mode for UART, so the programmed thresholds for interrupts
should not have any effect on our operation since we do not use those interrupts.

From documentation (RM0433 p.2080-2082), it seems UART + DMA does not wait for any threshold
or multiple bytes before transferring, it simply transfers one byte whenever possible
(TX FIFO is not full or RX FIFO is not empty). Since our number of bytes to transfer
varies between transfers (and is not known in advance for RX), this suits our
application.

Note for DMA transfers: The buffer/array in memory MUST be accessible by DMA1
for the DMA transfer to work. For example, the STM32H743 has DTCM RAM which is
not accessible by DMA1/DMA2 (only by the MDMA). If you try to use DMA1 with a
buffer in DTCM, a DMA transfer error is generated. Sometimes, a project
generated by STM32CubeIDE puts .data, .bss, and/or the stack in DTCM by default,
so be careful!

DMA has its own FIFO mode that is separate from UART's FIFO mode. For DMA's FIFO
mode, there is a programmed threshold (multiple bytes) for triggering transfers (RM0433 p.640-641,648-649).
For TX, it only transfers from memory to the FIFO when the FIFO is at or below the
threshold. For RX, it only transfers from the FIFO to memory when the FIFO is at
or above the threshold.

We use the DMA FIFO mode for TX, but not RX. For TX, we know exactly how many
bytes are to be transferred and program the DMA with that number, so the DMA transfers all of them, even if it is not
a multiple of the FIFO threshold. For RX, we use the buffer size to program the DMA with the
number of bytes to transfer (max possible number of RX bytes), but the actual number of
bytes transferred is less than that and is unknown in advance. As a result, even
with a 1/4 FIFO threshold, the number of RX bytes must be a multiple of 4 for the
DMA to transfer all of the bytes to the memory buffer. Because we want it to work
for any number of RX bytes, we disable FIFO mode for the RX DMA.
 */

#define UART_TX_BUF_SIZE 80
#define UART_RX_BUF_SIZE 80

// Baud rate is just an integer number, but make it an enum to limit possible
// baud values to only those that are practically used (to prevent typos)
typedef enum {
    UART_BAUD_9600 = 9600,
    UART_BAUD_115200 = 115200
} UARTBaud;

// TODO - variable sized buffers?
typedef struct {
    // HAL control
	UART_HandleTypeDef handle;
    DMA_HandleTypeDef tx_dma_handle;
    DMA_HandleTypeDef rx_dma_handle;

	// GPIO pins
	GPIO_ALT tx;
	GPIO_ALT rx;
	GPIO_ALT de;

	// Store a buffer of bytes (characters) in this UART struct to be sent by
	// the TX DMA.
	// It should be in the UART struct instead of the Log struct because we
	// expect to have many Log structs for each UART struct, so having a buffer
	// in each Log struct would be a big waste of memory.
	char tx_buf[UART_TX_BUF_SIZE];
	// Buffer for receiving bytes through the RX DMA
	char rx_buf[UART_RX_BUF_SIZE];
} UART;

extern UART *g_uart_usart1;
extern UART *g_uart_usart2;
extern UART *g_uart_usart3;
extern UART *g_uart_uart4;
extern UART *g_uart_uart5;
extern UART *g_uart_usart6;
extern UART *g_uart_uart7;
extern UART *g_uart_uart8;

extern UART *g_uart_def;

void uart_init(UART* uart,
        USART_TypeDef *instance, UARTBaud baud, uint8_t alt,
		GPIO_TypeDef *tx_port, uint16_t tx_pin,
		GPIO_TypeDef *rx_port, uint16_t rx_pin);
void uart_init_with_rs485(UART* uart,
        USART_TypeDef *instance, UARTBaud baud, uint8_t alt,
		GPIO_TypeDef *tx_port, uint16_t tx_pin,
		GPIO_TypeDef *rx_port, uint16_t rx_pin,
		GPIO_TypeDef *de_port, uint16_t de_pin);

void uart_write(UART *uart, uint8_t *buf, uint32_t count);
void uart_write_dma(UART *uart, uint8_t *buf, uint32_t count);

void uart_restart_rx_dma(UART *uart);
void uart_read(UART *uart);
uint32_t uart_get_rx_count(UART *uart);

uint32_t uart_read_uint(UART *uart);
int32_t uart_read_int(UART *uart);
char uart_read_char(UART *uart);

#endif /* DRIVERS_STM32_UART_UART_H_ */
